Revit 2026 API

# LoadBaseRemoveHostConstraint Method

---

Removes constraint from host for this load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveHostConstraint()
```
```vb
Public Sub RemoveHostConstraint
```
```cpp
public:
void RemoveHostConstraint()
```
```fsharp
member RemoveHostConstraint : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This LoadBase is not a constraint load. |
| ModificationForbiddenException | Thrown when the load is an AreaLoad and the host is an Analytical Panel with curved profile. |

#### Reference

LoadBase Class

Autodesk.Revit.DB.Structure Namespace